DESAFIO_CLASE40/result_test_info_artillery.txt
Phase started: unnamed (index: 0, duration: 1s) 23:18:18(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 23:18:19(-0300)

--------------------------------------
Metrics for period to: 23:18:20(-0300) (width: 1.269s)
--------------------------------------

http.codes.200: ................................................................ 127
http.request_rate: ............................................................. 116/sec
http.requests: ................................................................. 145
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 188
  median: ...................................................................... 100.5
  p95: ......................................................................... 156
  p99: ......................................................................... 172.5
http.responses: ................................................................ 127
vusers.created: ................................................................ 19
vusers.created_by_name.0: ...................................................... 19


--------------------------------------
Metrics for period to: 23:18:30(-0300) (width: 5.189s)
--------------------------------------

http.codes.200: ................................................................ 873
http.request_rate: ............................................................. 165/sec
http.requests: ................................................................. 855
http.response_time:
  min: ......................................................................... 5
  max: ......................................................................... 238
  median: ...................................................................... 100.5
  p95: ......................................................................... 172.5
  p99: ......................................................................... 214.9
http.responses: ................................................................ 873
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 1
vusers.created_by_name.0: ...................................................... 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4832.7
  max: ......................................................................... 5762.3
  median: ...................................................................... 5711.5
  p95: ......................................................................... 5711.5
  p99: ......................................................................... 5711.5


All VUs finished. Total time: 9 seconds

--------------------------------
Summary report @ 23:18:26(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 71/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 238
  median: ...................................................................... 100.5
  p95: ......................................................................... 172.5
  p99: ......................................................................... 210.6
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4832.7
  max: ......................................................................... 5762.3
  median: ...................................................................... 5711.5
  p95: ......................................................................... 5711.5
  p99: ......................................................................... 5711.5